Repository: xfce-mirror/xfce4-clipman-plugin
Catalog: po/*.po
Languages: ro, ug

source: Clipman
ug: Clipman چاپلاش تاختىسى باشقۇرغۇچ

source: Clipboard manager
ro: Gestionar clipboard
ug: چاپلاش تاختىسىنى باشقۇرغۇچ

source: Clipboard Manager provided as a panel plugin for Xfce and as a standalone application running in the notification area. It keeps a history of text and images of content copied to the clipboard. It also has a feature to execute actions on specific text selection by matching them against regexes.
ro: Gestionarul de clipboard oferit ca modul de panou pentru Xfce și ca aplicație autonomă care rulează în zona de notificare. Acesta păstrează un istoric al conținutului de text și imagini copiat în clipboard. De asemenea, are o caracteristică de a executa acțiuni pe selecții de text specifice prin potrivirea acestora cu expresii regulate.
ug: چاپلاش تاختىسى باشقۇرغۇچ Xfce نىڭ كۆزنەكچە قىستۇرمىسى، ئۇ ئۇقتۇرۇش رايونىدا ئايرىم ئىجرا قىلىنىدۇ. ئۇ تېكىست ۋە سۈرەتنىڭ چاپلاش تاختىسىغا كۆچۈرۈلۈش تارىخىنى ساقلاپ قالىدۇ. ئۇنىڭ يەنە تاللانغان تېكىست مۇنتىزىم ئىپادىگە ماس كەلگەندە مەشغۇلات ئىجرا قىلىش ئىقتىدارى بار.

source: Clipboard Manager
ro: Gestionar clipboard
ug: چاپلاش تاختىسىنى باشقۇرغۇچ

source: Clipboard Manager Autostart File
ro: Fișier auto-start pentru gestionarul de clipboard
ug: چاپلاش تاختىسىنى باشقۇرغۇچنىڭ ئۆزلۈكىدىن قوزغىلىش ھۆججىتى

source: None
ro: Nimic
ug: يوق

source: shows actions
ro: afișează acțiunile
ug: مەشغۇلاتنى كۆرسەت

source: hides actions
ro: ascunde acțiunile
ug: مەشغۇلاتنى يوشۇر

source: <b>Reset actions</b>
ro: <b>Reinițializare acțiuni</b>
ug: <b>مەشغۇلاتلارنى ئەسلىگە قايتۇرۇش</b>

source: Are you sure you want to reset the actions to the system default values?
ro: Sunteți sigur că doriți să readuceți acțiunile la valorile implicite ale sistemului?
ug: مەشغۇلاتلارنى سىستېمىنىڭ كۆڭۈلدىكى قىممىتىگە ئەسلىگە قايتۇرسۇنمۇ؟

source: Enter search phrase here
ro: Introduceți termenii de căutare
ug: ئىزدەيدىغاننى بۇ يەرگە كىرگۈزۈڭ

source: History is empty
ro: Jurnalul istoricului este gol
ug: تارىخ خاتىرىسى بوش

source: _Paste
ro: Li_pește
ug: چاپلا(_P)

source: _Copy
ro: _Copiază
ug: كۆچۈر(_C)

source: Clipman History
ro: Istoric Clipman
ug: Clipman تارىخى

source: _Help
ro: _Ajutor
ug: ياردەم(_H)

source: _Settings
ro: _Configurări
ug: تەڭشەك(_S)

source: Clipboard Manager Settings
ro: Configurări gestionar clipboard
ug: چاپلاش تاختىسىنى باشقۇرغۇچ تەڭشىكى

source: Customize your clipboard
ro: Personalizați-vă clipboard-ul
ug: چاپلاش تاختىسىنى خاسلاشتۇر

source: Clipman Settings
ro: Configurări Clipman
ug: Clipman تەڭشىكى

source: _Close
ro: În_chide
ug: ياپ(_C)

source: Sync mouse _selections
ro: Sincronizare _selecții mouse
ug: چاشقىنەك تاللاش قەدەمداش(_S)

source: If checked, selections will be synced with the default clipboard, so you can paste what you select with Ctrl-V. Conversely, manual copies will be synced with the primary clipboard, so you can paste what you copy with middle-click.
ro: Dacă este bifată, selecțiile vor fi sincronizate cu clipboard-ul implicit, astfel încât să puteți lipi ceea ce selectați cu Ctrl-V. Dimpotrivă, copiile manuale vor fi sincronizate cu clipboard-ul principal, astfel încât să puteți lipi ceea ce copiați cu clic pe butonul din mijloc al mouse-ului.
ug: ئەگەر تاللانسا، تاللانغان مەزمۇن بىلەن كۆڭۈلدىكى چاپلاش تاختىسى قەدەمداشلىنىدۇ، شۇڭا سىز Ctrl-V بىلەن تاللىغان مەزمۇننى چاپلىيالايسىز. ئەكسىچە، قولدا كۆچۈرۈش ئاساسىي چاپلاش تاختىسى بىلەن قەدەمداشلىنىدۇ شۇڭا ئوتتۇرا توپچە بىلەن كۆچۈرگەن مەزمۇننى چاپلىيالايسىز.

source: _Persist mouse selections
ro: Selecții _persistente ale mouse-ului
ug: ساقلاپ قالغان چاشقىنەك تاللىشى(_P)

source: If checked, the primary clipboard (middle-click paste) will persist until next selection if current selection is lost (e.g. by left-clicking anywhere in a text area)
ro: Dacă este bifată, clipboard-ul primar (lipire prin clic pe butonul din mijloc al mouse-ului) va persista până la următoarea selecție dacă selecția curentă este pierdută (de exemplu, prin clic cu butonul din stânga al mouse-ului oriunde într-o zonă de text)
ug: ئەگەر تاللانسا، ئاساسىي چاپلاش تاختىسى (ئوتتۇرا توپچە چېكىپ چاپلاش) نۆۋەتتىكى تاللاش يوقالغاندا (مەسىلەن، تېكىست رايونىنىڭ خالىغان جايىدا سول توپچە چېكىلىدۇ) كېيىنكى قېتىملىق تاللاشقىچە داۋاملىشىدۇ

source: _QR-Code support
ro: Suport pentru coduri _QR
ug: _QR قوللاش

source: If checked, the menu shows a QR-Code of the currently selected clipboard entry
ro: Dacă este bifată, meniul afișează un cod QR al intrării din clipboard selectate în prezent
ug: ئەگەر تاللانسا، تىزىملىك نۆۋەتتە تاللانغان چاپلاش تاختىسىدىكى تۈرنىڭ QR كودىنى كۆرسىتىدۇ

source: Automatically paste a selected item from the history
ro: Lipește automat un element selectat din istoric
ug: تاللانغان تۈرنى تارىخ خاتىرىسىدىن ئۆزلۈكىدىن چاپلايدۇ

source: _Paste instantly:
ro: Li_pire instantanee:
ug: شۇ ھامان چاپلا(_P):

source: <b>General</b>
ug: <b>ئادەتتىكى</b>

source: P_osition menu at mouse pointer
ro: P_poziționarea meniului la indicatorul mouse-ului
ug: تىزىملىك چاشقىنەك بار ئورۇندا تۇرسۇن(_O)

source: Popup the menu at the mouse pointer position: especially useful for the xfce4-popup-clipman command
ro: Afișează meniul la poziția indicatorului mouse-ului: util mai ales pentru comanda «xfce4-popup-clipman»
ug: چاشقىنەك نىشانلىغۇچىنىڭ ھازىرقى ئورنىدا تىزىملىكنى قاڭقىتىدۇ: بولۇپمۇ xfce4-popup-clipman بۇيرۇقىنى ئىشلىتىشكە پايدىلىق

source: Maximum items:
ro: Numărul maxim de elemente:
ug: ئەڭ كۆپ تۈر:

source: <b>Menu</b>
ro: <b>Meniu</b>
ug: <b>تىزىملىك</b>

source: _Behavior
ro: Comportame_nt
ug: ھەرىكەت(_B)

source: <b>_Enable automatic actions</b>
ro: <b>Activ_ează acțiunili automate</b>
ug: <b>ئاپتوماتىك مەشغۇلاتنى قوزغىتىدۇ(_E)</b>

source: If checked, the clipboard texts will be matched against regular expressions and a menu will display possible actions automatically. Otherwise the menu will only appear when calling "xfce4-popup-clipman-actions" (and a match was found)
ro: Dacă este bifată, textele din clipboard vor fi comparate cu expresiile regulate și un meniu va afișa automat acțiunile posibile. În caz contrar, meniul va apărea numai atunci când se apelează «xfce4-popup-clipman-actions» (și a fost găsită o potrivire)
ug: ئەگەر تاللانسا، مۇنتىزىم ئىپادە ئىشلىتىپ چاپلاش تاختىسىدىكى تېكىست بىلەن ماسلاشتۇرىدۇ ھەمدە تىزىملىكتە مۇمكىن بولغان مەشغۇلاتنى ئۆزلۈكىدىن كۆرسىتىدۇ. ئۇنداق بولمىسا، «xfce4-popup-clipman-actions» نى چاقىرغان (ۋە ماس كەلگىنى تېپىلغان) دا تىزىملىكنى كۆرسىتىدۇ

source: When the selection is done and the Control key is still pressed down, the popup menu for matched actions will be shown or hidden
ro: Când selecția este finalizată și tasta «Control» este încă apăsată, meniul contextual pentru acțiunile potrivite va fi afișat sau ascuns
ug: تاللاش تاماملىنىپ ھەمدە Control كۇنۇپكىسى بېسىپ تۇرۇلغان بولسا، ماس كېلىدىغان مەشغۇلاتنىڭ قاڭقىش تىزىملىكى كۆرۈنىدۇ ياكى يوشۇرۇلىدۇ

source: _Pressing Ctrl during selection:
ro: Apăsarea tastei «Ctrl» în timpul selecției:
ug: تاللاۋاتقاندا Ctrl بېسىلىدۇ(_P):

source: Add action
ro: Adaugă acțiune
ug: قوشۇش مەشغۇلاتى

source: Edit action
ro: Editează acțiunea
ug: تەھرىرلەش مەشغۇلاتى

source: Delete action
ro: Șterge acțiunea
ug: ئۆچۈرۈش مەشغۇلاتى

source: Reset all actions to the system default values
ro: Restabilește toate acțiunile la valorile implicite ale sistemului
ug: بارلىق مەشغۇلاتنى سىستېمىنىڭ كۆڭۈلدىكى قىممىتىگە قايتۇرىدۇ

source: _Actions
ro: _Acțiuni
ug: مەشغۇلات(_A)

source: <b>Remember history</b>
ro: <b>Memorează istoricul</b>
ug: <b>تارىخنى ئەستە تۇت</b>

source: Remember last copied _image
ro: Memorează ultima _imagine copiată
ug: ئاخىرقى كۆچۈرگەن سۈرەتنى ئەستە تۇت(_I)

source: If checked, this option allows one to store one image inside the history
ro: Dacă este bifată, această opțiune permite stocarea unei imagini în cadrul istoricului
ug: ئەگەر تاللانسا، بۇ تاللانما تارىخ خاتىرىسىگە بىر سۈرەت ساقلاشقا يول قويىدۇ

source: _Reorder history items
ro: _Reordonează elementele din istoric
ug: ئىزلارنى قايتا تەرتىپلە(_R)

source: Push last copied text to the top of the history, useful to reorder old items
ro: Plasează ultimul text copiat în partea de sus a istoricului, util pentru reordonarea elementelor vechi
ug: ئاخىرقى قېتىم كۆچۈرگەن تېكىستنى تارىخ خاتىرىسىنىڭ ئەڭ بېشىغا يۆتكەيدۇ، كونا تۈرنى قايتا تەرتىپلەشكە پايدىلىق

source: Re_verse history order
ro: In_versează ordinea istoricului
ug: ئىز تەرتىپىنى تەتۈر قىل(_V)

source: Reverse order of the history shown in the menu
ro: Inversează ordinea istoricului afișat în meniu
ug: تىزىملىكتە كۆرسىتىلگەن ئىزنىڭ تەرتىپىنى تەتۈر قىلىدۇ

source: Ignore mouse s_elections
ro: Ignoră s_elecțiile mouse-ului
ug: چاشقىنەك تاللاش رايونىغا پەرۋا قىلمايدۇ(_E)

source: If checked, the selections won't affect the history except the manual copies
ro: Dacă este bifată, selecțiile nu vor afecta istoricul, cu excepția copiilor manuale
ug: تاللانسا، ئىزغا قولدا كۆچۈرۈلگەن نەرسىلا كىرىدۇ، تاللانغان تېكىست رايونىغا تەسىر قىلمايدۇ

source: Size of the _history:
ro: Dimensiunea _istoricului:
ug: ئىزنىڭ چوڭلۇقى(_H):

source: H_istory
ro: _Istoric
ug: تارىخ(_I)

source: Edit Action
ro: Editează acțiunea
ug: تەھرىرلەش مەشغۇلاتى

source: _Cancel
ro: _Anulează
ug: ۋاز كەچ(_C)

source: _OK
ug: جەزملە(_O)

source: Name:
ro: Nume:
ug: ئاتى:

source: Pattern:
ro: Model:
ug: ئەندىزە:

source: You can use the substitution parameters "\1", "\2" and so on in the commands. The parameter "\0" represents the complete text. The pattern is always anchored within the special characters ^$
ro: Puteți utiliza parametrii de substituție „\1”, „\2” și așa mai departe în comenzi. Parametrul „\0” reprezintă textul complet. Modelul este întotdeauna anclat în caracterele speciale ^$
ug: بۇيرۇقتا «1\»، «2\» ۋە شۇنىڭغا ئوخشاش نامزات پارامېتىرلارنى ئىشلىتەلەيسىز. «0\» پارامېتىر تولۇق تېكىستكە ۋەكىللىك قىلىدۇ.مەزكۇر ئەندىزە ھەمىشە ئالاھىدە ھەرپ $^ ئىچىگە مۇقىملىنىدۇ

source: Activate on manual copy instead of selection
ro: Activată la copierea manuală în loc de selecție
ug: تاللاشنىڭ ئورنىغا قولدا كۆچۈرۈشنى ئاكتىپلايدۇ

source: By default the action is triggered by a selection: check this option to trigger the action when you make a manual copy instead. Note that in this case, the Control key no longer has any effect.
ro: În mod implicit, acțiunea este declanșată de o selecție: bifați această opțiune pentru a declanșa acțiunea atunci când efectuați o copiere manuală. Rețineți că, în acest caz, tasta «Control» nu mai are niciun efect.
ug: كۆڭۈلدىكى ئەھۋالدا، مەزكۇر مەشغۇلات تاللاشتىن قوزغىلىدۇ: ئەگەر قولدا كۆچۈرگەندە ئاندىن مەزكۇر مەشغۇلاتنى قوزغىتىشقا ئۆزگەرتمەكچى بولسىڭىز، بۇ تاللانمىنى تاللاڭ. ئەسكەرتىش، بۇ خىل ئەھۋالدا Control كۇنۇپكىسى ئۈنۈمىنى يوقىتىدۇ.

source: <b>Action</b>
ro: <b>Acțiune</b>
ug: <b>مەشغۇلات</b>

source: Command:
ro: Comandă:
ug: بۇيرۇق:

source: <b>Commands</b>
ro: <b>Comenzi</b>
ug: <b>بۇيرۇقلار</b>

source: Type here your custom text, for example a URL, a filename, etc.
ro: Introduceți aici textul dvs. personalizat, de exemplu o adresă URL, un nume de fișier etc.
ug: بۇ جايغا مەسىلەن تور ئادرېسى، ھۆججەت ئىسمى قاتارلىق ئىختىيارى ئۇچۇرنى كىرگۈزۈڭ.

source: Regular expression
ro: Expresie regulată
ug: مۇنتىزىم ئىپادە

source: _Disable
ro: _Dezactivează
ug: چەكلە(_D)

source: Unable to execute the command "%s" %s
ro: Nu s-a putut executa comanda „%s” %s
ug: بۇيرۇق "%s" نى ئىجرا قىلغىلى بولمىدى %s

source: Could not start the Clipboard Manager Daemon because it is already running.
ro: Nu s-a putut porni demonul de gestionare a clipboard-ului deoarece acesta rulează deja.
ug: چاپلاش تاختىسى باشقۇرغۇچ نازارەتچىسىنى قوزغىتالمىدى چۈنكى ئۇ ئىجرا قىلىنىۋېتىپتۇ.

source: The Xfce Clipboard Manager is already running.
ro: Gestionarul de clipboard Xfce rulează deja.
ug: Xfce چاپلاش تاختىسى باشقۇرغۇچ ئىجرا بولۇۋېتىپتۇ.

source: You can launch it with 'xfce4-clipman'.
ro: Îl puteți lansa cu comanda «xfce4-clipman».
ug: ئۇنى «xfce4-clipman» دە قوزغىتالايسىز.

source: The Clipboard Manager Daemon is not running.
ro: Demonul de gestionare a clipboard-ului nu rulează.
ug: چاپلاش تاختىسى باشقۇرغۇچ نازارەتچىسى ئىجرا بولمايۋاتىدۇ.

source: Are you sure you want to clear the history?
ro: Sunteți sigur că doriți să ștergeți istoricul?
ug: تارىخنى تازىلىۋېتەمسىز؟

source: Don't ask again
ro: Nu mai întreba
ug: قايتا سورىما

source: Unable to open the Clipman history dialog
ro: Nu se poate deschide fereastra de dialog a istoricului Clipman
ug: ‫Clipman نىڭ تارىخ خاتىرىسى سۆزلەشكۈسىنى ئاچالمايدۇ

source: _Clear history
ro: Șterge istori_cul
ug: تارىخ تازىلا(_C)

source: _Clear clipboard
ro: Șterge clipboard-ul
ug: چاپلاش تاختىسىنى تازىلا(_C)

source: Could not generate QR-Code.
ro: Nu s-a putut genera codul QR.
ug: ‫QR كودىنى ھاسىلليالمايدۇ.

source: _Show full history...
ro: Afișează i_storicul complet...
ug: تولۇق تارىخ خاتىرىسىنى كۆرسەت(_S)…

source: _Clipman settings...
ro: Configurări _Clipman
ug: Clipman تەڭشىكى()…

source: Contributors:
ro: Contribuitori:
ug: تۆھپىكارلار:

source: Clipboard Manager for Xfce
ro: Gestionar de clipboard pentru Xfce
ug: Xfce دىكى چاپلاش تاختىسىنى باشقۇرغۇچ

source: translator-credits
ro: Remus-Gabriel Chelu <remusgabriel.chelu@disroot.org>
ug: غەيرەت ت.كەنجى <gheyret@gmail.com> ئابدۇقادىر ئابلىز <sahranbay@gmail.com>

source: Unable to open the settings dialog
ro: Nu s-a putut deschide dialogul cu opțiuni
ug: تەڭشەك كۆزنىكىنى كۆرسەتكىلى بولمىدى
