<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Clipman &#35500;&#26126;&#26360;</title><link rel="stylesheet" href="../xfce.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.74.0"><link rel="home" href="#xfce4-clipman-plugin" title="Clipman &#35500;&#26126;&#26360;"><link rel="next" href="#intro" title="&#32057;&#20171;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="xfce4-clipman-plugin"></a>Clipman &#35500;&#26126;&#26360;</h2></div><div><div class="authorgroup"><div class="author"><h3 class="author"><span class="surname">Massonnet</span> <span class="firstname">Mike</span> [FAMILY Given]</h3><div class="affiliation"><div class="address"><p><code class="email">&lt;<a class="email" href="mailto:mmassonnet@xfce.org">mmassonnet@xfce.org</a>&gt;</code></p></div></div></div></div></div><div><span xmlns="http://www.w3.org/TR/xhtml1/transitional" class="releaseinfo">&#12371;&#12398;&#35500;&#26126;&#26360;&#12399; Clipman &#12398;&#12496;&#12540;&#12472;&#12519;&#12531; 1.1.0 &#12395;&#12388;&#12356;&#12390;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<br></br></span></div><div><p class="copyright">&#35069;&#20316;&#33879;&#20316; © 2009 Mike Massonnet</p></div><div><div class="legalnotice"><a name="legalnotice"></a><p>&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243;&#12364;&#20844;&#34920;&#12377;&#12427; GNU &#12501;&#12522;&#12540;&#25991;&#26360;&#21033;&#29992;&#35377;&#35582;&#22865;&#32004;&#26360;&#12398;&#31532;1.3&#29256;&#12289;&#12354;&#12427;&#12356;&#12399;&#12381;&#12428;&#20197;&#38477;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#29256;&#12398;&#26465;&#20214;&#19979;&#12395;&#12362;&#12356;&#12390;&#12289;&#12371;&#12398;&#25991;&#26360;&#12398;&#35079;&#35069;&#12289;&#37197;&#24067;&#12362;&#12424;&#12403;/&#12414;&#12383;&#12399;&#22793;&#26356;&#12364;&#35377;&#21487;&#12373;&#12428;&#12414;&#12377;&#12290;&#22793;&#26356;&#20986;&#26469;&#12394;&#12356;&#31623;&#25152;&#12289;&#34920;&#32025;&#25991;&#12362;&#12424;&#12403;&#35023;&#34920;&#32025;&#25991;&#12364;&#12354;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#21033;&#29992;&#35377;&#35582;&#22865;&#32004;&#26360;&#12398;&#20840;&#25991;&#12399;<a class="ulink" href="http://www.fsf.org/" target="_top">&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243;</a>&#12363;&#12425;&#21462;&#24471;&#12377;&#12427;&#20107;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></div></div><div><p class="pubdate">April, July 2009</p></div></div><hr></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="#intro">&#32057;&#20171;</a></span></dt><dd><dl><dt><span class="sect2"><a href="#anatomy-clipboard">&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#27083;&#36896;</a></span></dt><dt><span class="sect2"><a href="#getting-started">&#22987;&#12417;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;</a></span></dt><dt><span class="sect2"><a href="#popup-command">&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#12467;&#12510;&#12531;&#12489;</a></span></dt></dl></dd><dt><span class="sect1"><a href="#settings">&#35373;&#23450;</a></span></dt><dd><dl><dt><span class="sect2"><a href="#general">&#12300;&#19968;&#33324;&#12301;&#12479;&#12502;</a></span></dt><dt><span class="sect2"><a href="#actions">&#12300;&#12450;&#12463;&#12471;&#12519;&#12531;&#12301;&#12479;&#12502;</a></span></dt><dt><span class="sect2"><a href="#action-dialog">&#12450;&#12463;&#12471;&#12519;&#12531;&#12480;&#12452;&#12450;&#12525;&#12464;</a></span></dt><dt><span class="sect2"><a href="#xfconf">Xfconf</a></span></dt></dl></dd><dt><span class="sect1"><a href="#support">&#12469;&#12509;&#12540;&#12488;</a></span></dt><dt><span class="sect1"><a href="#about">Clipman &#12395;&#12388;&#12356;&#12390;</a></span></dt></dl></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="intro"></a>&#32057;&#20171;</h2></div></div></div><p>Clipman &#12399; Xfce &#29992;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12510;&#12493;&#12540;&#12472;&#12515;&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#36890;&#24120;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#32066;&#20102;&#12375;&#12383;&#26178;&#12395;&#22833;&#12431;&#12428;&#12390;&#12375;&#12414;&#12358;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#20869;&#23481;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;&#25991;&#23383;&#21015;&#12362;&#12424;&#12403;&#30011;&#20687;&#12434;&#25201;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#25991;&#23383;&#21015;&#12364;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#27491;&#35215;&#34920;&#29694;&#12392;&#12510;&#12483;&#12481;&#12375;&#12383;&#12392;&#12365;&#12395;&#20219;&#24847;&#12398;&#20966;&#29702;&#12434;&#23455;&#34892;&#12377;&#12427;&#27231;&#33021;&#12418;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="anatomy-clipboard"></a>&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#27083;&#36896;</h3></div></div></div><p>(&#12377;&#12409;&#12390;&#12398; Unix &#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#12362;&#12369;&#12427;) X11 &#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#12354;&#12425;&#12422;&#12427;&#12454;&#12451;&#12531;&#12489;&#12454;&#38291;&#12391;&#12487;&#12540;&#12479;&#12434;&#20132;&#25563;&#12377;&#12427;&#12383;&#12417;&#12395; 2 &#12388;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12399;&#12289;&#25163;&#21205;&#12398;&#12467;&#12500;&#12540;&#25805;&#20316; (&#20363;&#12360;&#12400;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12390;&#12467;&#12500;&#12540;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12383;&#12392;&#12365;&#12394;&#12393;) &#12395;&#12424;&#12387;&#12390;&#22793;&#26356;&#12373;&#12428;&#12289;&#12503;&#12521;&#12452;&#12510;&#12522;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12399;&#12289;&#23550;&#35937;&#12434;&#36984;&#25246;&#12375;&#12383;&#26178;&#28857; (&#20363;&#12360;&#12400;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#25991;&#23383;&#21015;&#12434;&#36984;&#25246;&#12375;&#12383;&#12392;&#12365;&#12394;&#12393;) &#12391;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>Clipman &#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#12415;&#20966;&#29702;&#12375;&#12414;&#12377;&#12364;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#36984;&#25246;&#38936;&#22495;&#12434;&#25201;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#36984;&#25246;&#38936;&#22495;&#12434;&#25201;&#12358;&#22580;&#21512;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12399;&#24120;&#12395;&#12381;&#12428;&#12392;&#12398;&#21516;&#26399;&#12364;&#12392;&#12425;&#12428;&#12289;&#21516;&#12376;&#20869;&#23481;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#30011;&#38754;&#19978;&#12434;&#36984;&#25246;&#12375;&#12289;&#12381;&#12428;&#12434;&#12461;&#12540;&#12508;&#12540;&#12489;&#12391;&#36028;&#12426;&#20184;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="getting-started"></a>&#22987;&#12417;&#12390;&#12415;&#12414;&#12375;&#12423;&#12358;</h3></div></div></div><p>Clipman &#12399;&#12289;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#23653;&#27508;&#12434;&#20445;&#25345;&#12375;&#12289;&#12381;&#12428;&#12425;&#12434;&#24489;&#20803;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;&#23653;&#27508;&#12399;&#12513;&#12452;&#12531;&#12450;&#12452;&#12467;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12427;&#12513;&#12491;&#12517;&#12540;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12289;&#24489;&#20803;&#12377;&#12427;&#12450;&#12452;&#12486;&#12512;&#12398;&#36984;&#25246;&#12362;&#12424;&#12403;&#23653;&#27508;&#12398;&#12463;&#12522;&#12450;&#12364;&#34892;&#12360;&#12414;&#12377;&#12290;</p><div class="figure"><a name="id2750689"></a><p class="title"><b>&#22259;1 Clipman &#12513;&#12491;&#12517;&#12540;</b></p><div class="figure-contents"><div class="mediaobject"><img src="images/clipman-menu.png" alt="&#23653;&#27508;&#34920;&#31034;&#12513;&#12491;&#12517;&#12540;"></div></div></div><br class="figure-break"><p>Clipman &#12434;&#23455;&#34892;&#12377;&#12427;&#12395;&#12399; 2 &#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#19968;&#12388;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12513;&#12491;&#12517;&#12540;&#12398;&#12450;&#12463;&#12475;&#12469;&#12522;&#37197;&#19979;&#12395;&#12354;&#12427; Clipman &#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12363;&#12425; <strong class="application"><code>xfce4-clipman</code></strong> &#12392;&#20837;&#21147;&#12375;&#12390;&#36215;&#21205;&#12377;&#12427;&#26041;&#27861;&#12289;&#12418;&#12358;&#19968;&#12388;&#12399;&#12497;&#12493;&#12523;&#12395;&#36861;&#21152;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;&#12497;&#12493;&#12523;&#12395;&#26032;&#12375;&#12356;&#12450;&#12452;&#12486;&#12512;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12497;&#12493;&#12523;&#12434;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12300;&#26032;&#12375;&#12356;&#12450;&#12452;&#12486;&#12512;&#12398;&#36861;&#21152;&#12301;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="popup-command"></a>&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#12467;&#12510;&#12531;&#12489;</h3></div></div></div><p>Clipman &#12399;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12484;&#12540;&#12523; <strong class="application"><code>xfce4-popup-clipman</code></strong> &#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12467;&#12510;&#12531;&#12489;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12392;&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12434;&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#12377;&#12427;&#12418;&#12398;&#12391;&#12289;<span class="guimenu"><strong>Xfce &#12513;&#12491;&#12517;&#12540;</strong></span>+<span class="guimenu"><strong>&#35373;&#23450;</strong></span>+<span class="guimenu"><strong>&#12461;&#12540;&#12508;&#12540;&#12489;</strong></span> &#12395;&#12354;&#12427; <span class="bold"><strong>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12471;&#12519;&#12540;&#12488;&#12459;&#12483;&#12488;</strong></span> &#12395;&#35373;&#23450;&#12377;&#12427;&#38555;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;</p></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="settings"></a>&#35373;&#23450;</h2></div></div></div><p>&#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464;&#12399;&#12289;&#12513;&#12452;&#12531;&#12450;&#12452;&#12467;&#12531;&#19978;&#12398;&#21491;&#12463;&#12522;&#12483;&#12463;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12513;&#12491;&#12517;&#12540;&#12398;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12450;&#12452;&#12486;&#12512;&#12434;&#36984;&#12406;&#12392;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12399;&#23653;&#27508;&#12398;&#35373;&#23450;&#12362;&#12424;&#12403;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#32232;&#38598;&#12364;&#34892;&#12360;&#12414;&#12377;&#12290;</p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="general"></a>&#12300;&#19968;&#33324;&#12301;&#12479;&#12502;</h3></div></div></div><p>&#20197;&#19979;&#12398;&#34920;&#12399;&#12289;&#21033;&#29992;&#21487;&#33021;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12390;&#12356;&#12414;&#12377;:</p><div class="table"><a name="id2750118"></a><p class="title"><b>&#34920;1 &#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#12398;&#19968;&#33324;&#12458;&#12503;&#12471;&#12519;&#12531;</b></p><div class="table-contents"><table xmlns="http://www.w3.org/TR/xhtml1/transitional" bgcolor="#F8F9FD" cellspacing="0" cellpadding="4" summary="&#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#12398;&#19968;&#33324;&#12458;&#12503;&#12471;&#12519;&#12531;" border="1"><colgroup><col xmlns=""><col xmlns=""></colgroup><thead xmlns=""><tr><th align="left">&#12458;&#12503;&#12471;&#12519;&#12531;</th><th align="left">&#35500;&#26126;</th></tr></thead><tbody xmlns=""><tr><td align="left">&#36984;&#25246;&#38936;&#22495;&#12392;&#21516;&#26399;&#12434;&#12392;&#12427;</td><td align="left">&#38936;&#22495;&#12434;&#36984;&#25246;&#12375;&#12383;&#12384;&#12369;&#12391;&#36028;&#12426;&#20184;&#12369;&#12391;&#12365;&#12427;&#12424;&#12358;&#12289;&#12503;&#12521;&#12452;&#12510;&#12522;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12392;&#12487;&#12501;&#12457;&#12523;&#12488;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#21516;&#26399;&#12364;&#12392;&#12425;&#12428;&#12414;&#12377;</td></tr><tr><td align="left">&#23653;&#27508;&#12395;&#27531;&#12373;&#12394;&#12356;</td><td align="left">&#12503;&#12521;&#12452;&#12510;&#12522;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#20869;&#23481;&#12434;&#23653;&#27508;&#12395;&#26684;&#32013;&#12375;&#12414;&#12379;&#12435;</td></tr><tr><td align="left">&#32066;&#20102;&#26178;&#12395;&#20445;&#23384;&#12377;&#12427;</td><td align="left">&#23653;&#27508;&#12434;&#20445;&#23384;&#12375;&#12289;&#26032;&#12375;&#12356;&#12475;&#12483;&#12471;&#12519;&#12531;&#38283;&#22987;&#26178;&#12395;&#24489;&#20803;&#12375;&#12414;&#12377;</td></tr><tr><td align="left">&#30011;&#20687;&#12434;&#26684;&#32013;&#12377;&#12427;</td><td align="left">&#23653;&#27508;&#12395;&#30011;&#20687;&#12434;&#26684;&#32013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;</td></tr><tr><td align="left">&#23653;&#27508;&#12398;&#12469;&#12452;&#12474;</td><td align="left">&#25991;&#23383;&#21015;&#23653;&#27508;&#12395;&#20445;&#25345;&#12377;&#12427;&#12450;&#12452;&#12486;&#12512;&#25968;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;</td></tr></tbody></table></div></div><br class="table-break"><div class="figure"><a name="id2750208"></a><p class="title"><b>&#22259;2 Clipman &#35373;&#23450;</b></p><div class="figure-contents"><div class="mediaobject"><img src="images/clipman-settings-general.png" alt="&#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464; - &#12300;&#19968;&#33324;&#12301;&#12479;&#12502;"></div></div></div><br class="figure-break"></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="actions"></a>&#12300;&#12450;&#12463;&#12471;&#12519;&#12531;&#12301;&#12479;&#12502;</h3></div></div></div><p>&#19968;&#12388;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#12450;&#12463;&#12471;&#12519;&#12531;&#21517;&#12392;&#27491;&#35215;&#34920;&#29694;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12363;&#12425;&#12394;&#12426;&#12414;&#12377;&#12290;&#21508;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#19968;&#12388;&#20197;&#19978;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#12469;&#12509;&#12540;&#12488;&#12399;&#20219;&#24847;&#12391;&#12354;&#12426;&#12289;&#12300;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#26377;&#21177;/&#28961;&#21177;&#12434;&#20999;&#12426;&#25563;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p>&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#36861;&#21152;&#12450;&#12452;&#12467;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12390;&#32232;&#38598;&#12450;&#12452;&#12467;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12363;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12390;&#21066;&#38500;&#12450;&#12452;&#12467;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#36861;&#21152;&#12414;&#12383;&#12399;&#32232;&#38598;&#12395;&#12424;&#12426;&#26032;&#12375;&#12356;&#12480;&#12452;&#12450;&#12525;&#12464;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12398;&#12424;&#12426;&#35443;&#12375;&#12356;&#24773;&#22577;&#12399;&#12289;<a class="xref" href="#action-dialog" title="&#12450;&#12463;&#12471;&#12519;&#12531;&#12480;&#12452;&#12450;&#12525;&#12464;">&#12300;&#12450;&#12463;&#12471;&#12519;&#12531;&#12480;&#12452;&#12450;&#12525;&#12464;&#12301;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><div class="figure"><a name="id2750391"></a><p class="title"><b>&#22259;3 Clipman &#35373;&#23450;</b></p><div class="figure-contents"><div class="mediaobject"><img src="images/clipman-settings-actions.png" alt="&#35373;&#23450;&#12480;&#12452;&#12450;&#12525;&#12464; - &#12300;&#12450;&#12463;&#12471;&#12519;&#12531;&#12301;&#12479;&#12502;"></div></div></div><br class="figure-break"></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="action-dialog"></a>&#12450;&#12463;&#12471;&#12519;&#12531;&#12480;&#12452;&#12450;&#12525;&#12464;</h3></div></div></div><p>&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#12510;&#12483;&#12481;&#12377;&#12427;&#12497;&#12479;&#12540;&#12531;&#12434;&#35500;&#26126;&#12377;&#12427;&#21517;&#21069;&#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#19968;&#12388;&#12398;&#12467;&#12510;&#12531;&#12489;&#12392;&#12289;&#12381;&#12398;&#21517;&#21069;&#12434;&#25345;&#12383;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12510;&#12483;&#12481;&#12375;&#12383;&#25991;&#23383;&#21015;&#12399;&#12467;&#12510;&#12531;&#12489;&#20869;&#12391;&#20877;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p>&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#20182;&#12391;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#38480;&#12426;&#12289;&#24120;&#12395;&#36984;&#25246;&#12373;&#12428;&#12383;&#25991;&#23383;&#21015;&#12395;&#23550;&#12375;&#12390;&#12510;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377;&#12290;&#12300;&#25163;&#21205;&#12467;&#12500;&#12540;&#26178;&#12398;&#12415;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12377;&#12427;&#12301;&#12395;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;&#12434;&#12388;&#12369;&#12427;&#12392;&#12289;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#23550;&#12375;&#12390;&#12398;&#12415;&#12510;&#12483;&#12481;&#12373;&#12428;&#12414;&#12377; (&#20363;&#12360;&#12400; Ctrl+C &#12364;&#25276;&#19979;&#12373;&#12428;&#12383;&#12392;&#12365;&#12394;&#12393;)&#12290;</p><div class="figure"><a name="id2751061"></a><p class="title"><b>&#22259;4 &#12450;&#12463;&#12471;&#12519;&#12531;&#12480;&#12452;&#12450;&#12525;&#12464;</b></p><div class="figure-contents"><div class="mediaobject"><img src="images/clipman-action-dialog.png" alt="&#12300;&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#32232;&#38598;&#12301;&#12480;&#12452;&#12450;&#12525;&#12464;"></div></div></div><br class="figure-break"><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="regexes"></a>&#27491;&#35215;&#34920;&#29694;</h4></div></div></div><p>&#22522;&#26412;&#29305;&#27530;&#25991;&#23383;: "<span class="bold"><strong><code class="code">.?+*(|)[]\</code></strong></span>".</p><div class="itemizedlist"><ul type="disc"><li>&#8220;<span class="bold"><strong><code class="code">.</code></strong></span>&#8221;: &#20219;&#24847;&#12398;&#19968;&#25991;&#23383;&#12395;&#12510;&#12483;&#12481;&#12375;&#12414;&#12377;&#12290;</li><li>&#8220;<span class="bold"><strong><code class="code">?+*</code></strong></span>&#8221;: &#12381;&#12428;&#12382;&#12428;&#12289;&#30452;&#21069;&#12398;&#25991;&#23383;&#12364; 0 &#20491;&#12363; 1 &#20491;&#12289;1 &#20491;&#20197;&#19978;&#12289;&#12362;&#12424;&#12403; 0 &#20491;&#20197;&#19978;&#12354;&#12427;&#12392;&#12365;&#12395;&#12510;&#12483;&#12481;&#12375;&#12414;&#12377;&#12290;</li><li>&#8220;<span class="bold"><strong><code class="code">(|)</code></strong></span>&#8221;: &#12464;&#12523;&#12540;&#12503;&#21270;&#12392;&#32622;&#25563;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12496;&#12540;&#12481;&#12459;&#12523;&#12496;&#12540;&#8220;|&#8221;&#12399;&#35542;&#29702;&#21644;&#28436;&#31639;&#23376;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</li><li>&#8220;<span class="bold"><strong><code class="code">[^]</code></strong></span>&#8221;: &#25324;&#24359;&#20869;&#12395;&#21547;&#12414;&#12428;&#12427; 1 &#20491;&#12398;&#25991;&#23383;&#12414;&#12383;&#12399;&#29305;&#27530;&#25991;&#23383;&#12395;&#12510;&#12483;&#12481;&#12375;&#12414;&#12377;&#12290;&#12469;&#12540;&#12459;&#12512;&#12501;&#12524;&#12483;&#12463;&#12473;&#8220;^&#8221;&#12364;&#20808;&#38957;&#12395;&#12354;&#12427;&#12392;&#35542;&#29702;&#21542;&#23450;&#12392;&#12394;&#12426;&#12289;&#25324;&#24359;&#20869;&#12395;&#21547;&#12414;&#12428;&#12394;&#12356; 1 &#20491;&#12398;&#25991;&#23383;&#12414;&#12383;&#12399;&#29305;&#27530;&#25991;&#23383;&#12395;&#12510;&#12483;&#12481;&#12375;&#12414;&#12377;&#12290;</li><li>&#8220;<span class="bold"><strong><code class="code">\</code></strong></span>&#8221;: &#29305;&#27530;&#25991;&#23383;&#12434;&#12456;&#12473;&#12465;&#12540;&#12503;&#12375;&#12414;&#12377;&#12290;</li></ul></div><p>&#22522;&#26412;&#33521;&#25968;&#23383;&#12463;&#12521;&#12473;: "<span class="bold"><strong><code class="code">A-Za-z0-9</code></strong></span>"&#12290;&#25991;&#23383;&#12463;&#12521;&#12473;&#12399;&#25991;&#23383;&#12398;&#12475;&#12483;&#12488;&#12395;&#12510;&#12483;&#12481;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395;&#35282;&#25324;&#24359;&#8220;[]&#8221;&#20869;&#12391;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p><div class="sect4" lang="ja"><div class="titlepage"><div><div><h5 class="title"><a name="regexes-examples"></a>&#20363;</h5></div></div></div><div class="itemizedlist"><ul type="disc"><li>"<span class="bold"><strong><code class="code">bug ?#?[0-9]+</code></strong></span>": &#25991;&#23383;&#21015; "<span class="emphasis"><em>bug</em></span>"&#12289;0 &#20491;&#12363; 1 &#20491;&#12398;&#12473;&#12506;&#12540;&#12473;&#12289;0 &#20491;&#12363; 1 &#20491;&#12398;&#30058;&#21495;&#35352;&#21495;&#8220;#&#8221;&#12289;&#12362;&#12424;&#12403; 1 &#20491;&#20197;&#19978;&#12398;&#30058;&#21495;&#12395;&#12510;&#12483;&#12481;&#12377;&#12427;&#12290;</li><li>"<span class="bold"><strong><code class="code">(http|ftp).+\.(jpg|png|gif)</code></strong></span>": &#25991;&#23383;&#21015; "<span class="emphasis"><em>http</em></span>" &#12414;&#12383;&#12399; "<span class="emphasis"><em>ftp</em></span>"&#12289;1 &#20491;&#20197;&#19978;&#12398;&#25991;&#23383;&#12289;&#12500;&#12522;&#12458;&#12489;&#8220;.&#8221;&#12289;&#12362;&#12424;&#12403;&#25991;&#23383;&#21015; "<span class="emphasis"><em>jpg</em></span>"&#12289;"<span class="emphasis"><em>png</em></span>"&#12289;&#12354;&#12427;&#12356;&#12399; "<span class="emphasis"><em>gif</em></span>" &#12395;&#12510;&#12483;&#12481;&#12377;&#12427;&#12290;</li><li>"<span class="bold"><strong><code class="code">http://.{120}[^ ]+</code></strong></span>": &#25991;&#23383;&#21015; "<span class="emphasis"><em>http://</em></span>"&#12289;120 &#20491;&#12398;&#25991;&#23383;&#12289;&#12362;&#12424;&#12403; 1 &#20491;&#20197;&#19978;&#12398;&#12473;&#12506;&#12540;&#12473;&#20197;&#22806;&#12398;&#25991;&#23383;&#12395;&#12510;&#12483;&#12481;&#12377;&#12427;&#12290;</li></ul></div></div><div class="sect4" lang="ja"><div class="titlepage"><div><div><h5 class="title"><a name="regexes-external-ressource"></a>&#12381;&#12398;&#20182;&#12398;&#24773;&#22577;</h5></div></div></div><p>&#27491;&#35215;&#34920;&#29694;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="ulink" href="http://ja.wikipedia.org/wiki/%E6%AD%A3%E8%A6%8F%E8%A1%A8%E7%8F%BE" target="_top">Wikipedia &#12398;&#35352;&#20107;</a>&#12394;&#12393;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div></div><div class="sect3" lang="ja"><div class="titlepage"><div><div><h4 class="title"><a name="command"></a>&#12467;&#12510;&#12531;&#12489;</h4></div></div></div><p>&#12467;&#12510;&#12531;&#12489;&#12399;&#27491;&#35215;&#34920;&#29694;&#12363;&#12425; 1 &#20491;&#20197;&#19978;&#12398;&#32622;&#25563;&#25991;&#23383;&#21015;&#12434;&#20877;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#32622;&#25563;&#25991;&#23383;&#21015;&#12399;&#8220;<span class="bold"><strong><code class="code">\&lt;number&gt;</code></strong></span>&#8221;&#12391;&#34920;&#12373;&#12428;&#12289;&lt;number&gt; &#12399;&#12497;&#12479;&#12540;&#12531;&#20869;&#12398;&#20024;&#25324;&#24359;&#8220;()&#8221;&#12391;&#25324;&#12425;&#12428;&#12383;&#12469;&#12502;&#12497;&#12479;&#12540;&#12531;&#12398;&#38918;&#30058; (&#19968;&#30058;&#24038;&#12364; 1) &#12395;&#12289;0 &#12399;&#23436;&#20840;&#12394;&#25991;&#23383;&#21015;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;</p><p>&#20363;&#12360;&#12400;&#12289;&#12471;&#12531;&#12503;&#12523;&#12394;&#12497;&#12479;&#12540;&#12531;&#8220;<span class="bold"><strong><code class="code">bug #(123)</code></strong></span>&#8221;&#12391;&#12399;&#12289;&#8220;<span class="bold"><strong><code class="code">\0</code></strong></span>&#8221;&#12364;&#25991;&#23383;&#21015;&#8220;bug #123&#8221;&#12395;&#12289;&#8220;<span class="bold"><strong><code class="code">\1</code></strong></span>&#8221;&#12364;&#25991;&#23383;&#21015;&#8220;123&#8221;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;&#12467;&#12510;&#12531;&#12489;&#8220;<code class="code">exo-open http://host/\1</code>&#8221;&#12398;&#22580;&#21512;&#12289;&#23455;&#38555;&#12395;&#23455;&#34892;&#12373;&#12428;&#12427;&#12467;&#12510;&#12531;&#12489;&#12399;&#8220;<code class="code">exo-open http://host/123</code>&#8221;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="xfconf"></a>Xfconf</h3></div></div></div><p>Clipman &#12399;&#12289;&#12381;&#12398;&#35373;&#23450;&#12398;&#20445;&#23384;&#12395; Xfconf &#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426; <strong class="application"><code>xfconf-query</code></strong> &#12420; <strong class="application"><code>xfce4-settings-editor</code></strong> &#12484;&#12540;&#12523;&#12391;&#12418;&#35373;&#23450;&#12398;&#22793;&#26356;&#12364;&#34892;&#12360;&#12414;&#12377;&#12290;&#12481;&#12515;&#12531;&#12493;&#12523;&#12399; <code class="constant">xfce4-panel</code>&#12289;&#12505;&#12540;&#12473;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399; <code class="constant">/plugins/clipman</code> &#12391;&#12377;&#12290;&#20197;&#19979;&#12398;&#34920;&#12399;&#35373;&#23450;&#21487;&#33021;&#12394;&#20516;&#12398;&#12522;&#12473;&#12488;&#12391;&#12377;&#12290;</p><div class="table"><a name="id2751397"></a><p class="title"><b>&#34920;2 Xfconf &#12503;&#12525;&#12497;&#12486;&#12451;</b></p><div class="table-contents"><table xmlns="http://www.w3.org/TR/xhtml1/transitional" bgcolor="#F8F9FD" cellspacing="0" cellpadding="4" summary="Xfconf &#12503;&#12525;&#12497;&#12486;&#12451;" border="1"><colgroup><col xmlns=""><col xmlns=""><col xmlns=""><col xmlns=""></colgroup><thead xmlns=""><tr><th align="left">&#12503;&#12525;&#12497;&#12486;&#12451;</th><th align="left">&#12487;&#12540;&#12479;&#22411;</th><th align="left">&#12487;&#12501;&#12457;&#12523;&#12488;</th><th align="left">&#20516;</th></tr></thead><tbody xmlns=""><tr><td align="left">/settings/add-primary-clipboard</td><td align="left">bool</td><td align="left">false</td><td align="left">ture &#12391;&#12503;&#12521;&#12452;&#12510;&#12522;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12392;&#12487;&#12501;&#12457;&#12523;&#12488;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#21516;&#26399;&#12434;&#12392;&#12426;&#12414;&#12377;</td></tr><tr><td align="left">/settings/enable-actions</td><td align="left">bool</td><td align="left">false</td><td align="left">true &#12391;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;</td></tr><tr><td align="left">/settings/history-ignore-primary-clipboard</td><td align="left">bool</td><td align="left">false</td><td align="left">true &#12391;&#12503;&#12521;&#12452;&#12510;&#12522;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12398;&#20869;&#23481;&#12434;&#23653;&#27508;&#12395;&#27531;&#12375;&#12414;&#12379;&#12435;</td></tr><tr><td align="left">/settings/max-images-in-history</td><td align="left">uint</td><td align="left">0</td><td align="left">0-5 &#30011;&#20687;&#23653;&#27508;&#12398;&#25968;&#12391;&#12377;</td></tr><tr><td align="left">/settings/max-texts-in-history</td><td align="left">uint</td><td align="left">10</td><td align="left">5-100 &#25991;&#23383;&#21015;&#23653;&#27508;&#12398;&#25968;&#12391;&#12377;</td></tr><tr><td align="left">/settings/save-on-quit</td><td align="left">bool</td><td align="left">true</td><td align="left">true &#12391;&#26032;&#12375;&#12356;&#12475;&#12483;&#12471;&#12519;&#12531;&#38283;&#22987;&#26178;&#12395;&#23653;&#27508;&#12434;&#24489;&#20803;&#12375;&#12414;&#12377;</td></tr></tbody></table></div></div><br class="table-break"><p>&#12479;&#12540;&#12511;&#12490;&#12523;&#12363;&#12425;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12391;&#35373;&#23450;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;:</p><code class="literal">xfconf-query -c xfce4-panel -p /plugins/clipman/&lt;property&gt; -s &lt;value&gt;</code></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="support"></a>&#12469;&#12509;&#12540;&#12488;</h2></div></div></div><p>&#12496;&#12464;&#12398;&#22577;&#21578;&#12420;&#35201;&#26395;&#12399;&#12289;<a class="ulink" href="http://bugzilla.xfce.org/" target="_top">http://bugzilla.xfce.org/</a> &#12395;&#12354;&#12427;&#12496;&#12464;&#36861;&#36321;&#12471;&#12473;&#12486;&#12512;&#12434;&#20351;&#29992;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;&#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#20351;&#12356;&#26041;&#12395;&#38306;&#12377;&#12427;&#36074;&#21839;&#12364;&#12354;&#12428;&#12400;&#12289;<a class="ulink" href="http://foo-projects.org/mailman/listinfo/xfce" target="_top">Xfce &#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;</a> &#12391;&#23563;&#12397;&#12427;&#12363;&#12289;IRC &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391; <span class="bold"><strong>irc.freenode.net</strong></span> &#12398;&#12481;&#12515;&#12531;&#12493;&#12523; <span class="bold"><strong>#xfce</strong></span> &#12395;&#21442;&#21152;&#12375;&#12289;&#21161;&#12369;&#12434;&#27714;&#12417;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="about"></a>Clipman &#12395;&#12388;&#12356;&#12390;</h2></div></div></div><p>Clipman &#12399; Eduard Roccatello &#12395;&#12424;&#12387;&#12390;&#35069;&#20316;&#12373;&#12428;&#12289;Nick Schermer &#12395;&#12424;&#12387;&#12390;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;&#29694;&#22312;&#12399; Mike Massonnet (<code class="email">&lt;<a class="email" href="mailto:mmassonnet@xfce.org">mmassonnet@xfce.org</a>&gt;</code>) &#12395;&#12424;&#12387;&#12390;&#35069;&#20316;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12424;&#12426;&#35443;&#12375;&#12356;&#24773;&#22577;&#12399; <a class="ulink" href="http://goodies.xfce.org/projects/panel-plugins/xfce4-clipman-plugin" target="_top">Clipman &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;</a> &#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12371;&#12398;&#25991;&#26360;&#12399; Mike Massonnet (<code class="email">&lt;<a class="email" href="mailto:mmassonnet@xfce.org">mmassonnet@xfce.org</a>&gt;</code>) &#12364;&#35069;&#20316;&#12375;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#35500;&#26126;&#26360;&#12395;&#38306;&#12377;&#12427;&#12467;&#12513;&#12531;&#12488;&#12420;&#12372;&#25552;&#26696;&#12399; <code class="email">&lt;<a class="email" href="mailto:mmassonnet@xfce.org">mmassonnet@xfce.org</a>&gt;</code> &#12414;&#12391;&#12362;&#39000;&#12356;&#12375;&#12414;&#12377;&#12290;</p><p>&#12371;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243;&#12364;&#20844;&#34920;&#12377;&#12427; <em class="citetitle">GNU &#19968;&#33324;&#20844;&#34886;&#21033;&#29992;&#35377;&#35582;&#22865;&#32004;&#26360;</em>&#12398;&#26465;&#20214;&#19979;&#12395;&#37197;&#24067;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#31532;2&#29256;&#12354;&#12427;&#12356;&#12399;&#12289;(&#12354;&#12394;&#12383;&#12364;&#36984;&#12406;) &#12381;&#12428;&#20197;&#38477;&#12398;&#29256;&#12398;&#12356;&#12378;&#12428;&#12363;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12399;&#12289;<em class="citetitle">GNU &#19968;&#33324;&#20844;&#34886;&#21033;&#29992;&#35377;&#35582;&#22865;&#32004;&#26360;</em>&#12398;&#12467;&#12500;&#12540;&#12364;&#38468;&#23646;&#12377;&#12427;&#12399;&#12378;&#12391;&#12377;&#12364;&#12289;&#12418;&#12375;&#28961;&#12356;&#12398;&#12391;&#12354;&#12428;&#12400;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#36001;&#22243; (51 Franklin Street, Fifth Floor, Boston, MA 02110, USA) &#12395;&#36899;&#32097;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div></div></body></html>
